Repository: t1dotdev/water-buddy
Catalog: water-buddy/Resources/Localizable/*.lproj/Localizable.strings
Languages: th

# app.name
source: Water Tracker
th: แอปติดตามการดื่มน้ำ

# tab.home
source: Home
th: หน้าหลัก

# tab.statistics
source: Stats
th: สถิติ

# tab.add_water
source: Add Water
th: เพิ่มน้ำ

# tab.history
source: History
th: ประวัติ

# tab.settings
source: Settings
th: ตั้งค่า

# home.title
source: Water Tracker
th: แอปติดตามการดื่มน้ำ

# greeting.morning
source: Good Morning
th: สวัสดีตอนเช้า

# greeting.afternoon
source: Good Afternoon
th: สวัสดีตอนบ่าย

# greeting.evening
source: Good Evening
th: สวัสดีตอนเย็น

# greeting.night
source: Good Night
th: สวัสดีตอนค่ำ

# progress.of_goal
source: of %@
th: จาก %@

# motivation.start
source: Great start! Keep hydrating! 💧
th: เริ่มต้นที่ดี! ดื่มน้ำต่อไป! 💧

# motivation.quarter
source: You're doing well! Keep it up! 👍
th: คุณทำได้ดี! ทำต่อไป! 👍

# motivation.half
source: Halfway there! You've got this! 💪
th: ครึ่งทางแล้ว! คุณทำได้! 💪

# motivation.almost
source: Almost there! Final push! 🏃
th: เกือบถึงแล้ว! ใกล้สำเร็จ! 🏃

# motivation.achieved
source: Goal achieved! Fantastic! 🎉
th: บรรลุเป้าหมายแล้ว! ยอดเยี่ยม! 🎉

# streak.description
source: day streak
th: วันต่อเนื่อง

# streak.start
source: Start your streak!
th: เริ่มสร้างสถิติของคุณ!

# streak.one_day
source: day streak
th: วันต่อเนื่อง

# streak.multiple_days
source: days streak
th: วันต่อเนื่อง

# weather.hydration_tip
source: Hydration Tip
th: คำแนะนำการดื่มน้ำ

# weather.loading
source: Loading weather data...
th: กำลังโหลดข้อมูลสภาพอากาศ...

# weather.unavailable
source: Weather data unavailable
th: ไม่มีข้อมูลสภาพอากาศ

# weather.sunny
source: Sunny
th: แดดจัด

# weather.cloudy
source: Cloudy
th: มีเมฆ

# weather.rainy
source: Rainy
th: ฝนตก

# weather.snowy
source: Snowy
th: หิมะตก

# weather.hot
source: Hot
th: ร้อน

# weather.humid
source: Humid
th: ชื้น

# weather.recommendation.normal
source: Normal hydration recommended
th: แนะนำให้ดื่มน้ำตามปกติ

# weather.recommendation.hot
source: Hot weather! Increase water intake by 20%
th: อากาศร้อน! เพิ่มการดื่มน้ำ 30%

# weather.recommendation.warm
source: Warm weather. Increase water intake by 10%
th: อากาศอบอุ่น เพิ่มการดื่มน้ำ 15%

# weather.recommendation.dry
source: Dry air increases dehydration.
th: อากาศแห้งทำให้ขาดน้ำได้ง่าย

# weather.recommendation.humid
source: High humidity requires extra hydration.
th: ความชื้นสูงต้องดื่มน้ำเพิ่ม

# weather.recommendation.sunny
source: Sunny conditions increase water needs.
th: สภาพอากาศแดดจัดต้องดื่มน้ำมากขึ้น

# weather.recommendation.extreme_heat
source: Extreme heat! Critical to stay hydrated. Increase water intake by 50%
th: อากาศร้อนจัด! ดื่มน้ำให้เพียงพอ

# weather.recommendation.very_humid
source: Very humid conditions increase sweating.
th: อากาศชื้นมากทำให้เหงื่อออกมาก

# add_water.title
source: Add Water
th: เพิ่มน้ำ

# add_water.quick_select
source: Quick Select
th: เลือกด่วน

# add_water.container
source: Container Type
th: ประเภทภาชนะ

# add_water.select_container
source: Select Container
th: เลือกภาชนะ

# add_water.quick_amounts
source: Quick Amounts
th: ปริมาณด่วน

# add_water.custom_amount
source: Custom Amount
th: ปริมาณกำหนดเอง

# add_water.recent_amounts
source: Recent Amounts
th: ปริมาณล่าสุด

# add_water.enter_amount
source: Enter amount (ml)
th: ใส่ปริมาณ (มล.)

# add_water.add_custom
source: Add Custom Amount
th: เพิ่มปริมาณกำหนดเอง

# add_water.add_button
source: Add %d ml
th: เพิ่ม %d มล.

# add_water.success
source: Added %dml successfully!
th: เพิ่ม %d มล. สำเร็จ!

# add_water.invalid_amount
source: Please enter a valid amount between 1-5000ml
th: กรุณาใส่ปริมาณที่ถูกต้อง 1-5000 มล.

# add_water.invalid_format
source: Invalid number format
th: รูปแบบตัวเลขไม่ถูกต้อง

# container.glass
source: Glass
th: แก้วน้ำ

# container.bottle
source: Bottle
th: ขวดน้ำ

# container.cup
source: Cup
th: ถ้วย

# container.mug
source: Mug
th: แก้วกาแฟ

# container.custom
source: Custom
th: กำหนดเอง

# container.custom_amount
source: Custom
th: กำหนดเอง

# unit.milliliters
source: Milliliters
th: มิลลิลิตร

# unit.ounces
source: Ounces
th: ออนซ์

# stats.title
source: Statistics
th: สถิติ

# stats.today
source: Today
th: วันนี้

# stats.week
source: Week
th: สัปดาห์

# stats.month
source: Month
th: เดือน

# stats.year
source: Year
th: ปี

# chart.weekly_progress
source: Weekly Progress
th: ความคืบหน้ารายสัปดาห์

# period.today
source: Today
th: วันนี้

# period.week
source: This Week
th: สัปดาห์นี้

# period.month
source: This Month
th: เดือนนี้

# period.year
source: This Year
th: ปีนี้

# history.title
source: History
th: ประวัติ

# history.no_entries
source: No entries found
th: ไม่พบรายการ

# history.delete_entry
source: Delete Entry
th: ลบรายการ

# history.edit_entry
source: Edit Entry
th: แก้ไขรายการ

# settings.title
source: Settings
th: ตั้งค่า

# settings.profile
source: Profile
th: โปรไฟล์

# settings.daily_goal
source: Daily Goal
th: เป้าหมายรายวัน

# settings.units
source: Units
th: หน่วย

# settings.reminders
source: Reminders
th: การแจ้งเตือน

# settings.enable_reminders
source: Enable Reminders
th: เปิดการแจ้งเตือน

# settings.reminder_time
source: Reminder Time
th: เวลาแจ้งเตือน

# settings.language
source: Language
th: ภาษา

# settings.app_info
source: App Info
th: ข้อมูลแอป

# settings.version
source: Version
th: เวอร์ชัน

# settings.on
source: On
th: เปิด

# settings.off
source: Off
th: ปิด

# settings.enable
source: Enable
th: เปิด

# settings.disable
source: Disable
th: ปิด

# settings.enter_goal
source: Enter your daily water goal (ml)
th: ใส่เป้าหมายการดื่มน้ำรายวัน (มล.)

# settings.goal_updated
source: Daily goal updated successfully
th: อัปเดตเป้าหมายรายวันสำเร็จ

# settings.unit_updated
source: Unit updated successfully
th: อัปเดตหน่วยสำเร็จ

# settings.language_updated
source: Language updated successfully
th: เปลี่ยนภาษาสำเร็จ

# settings.reminder_toggle_message
source: Would you like to receive daily water reminders?
th: คุณต้องการรับการแจ้งเตือนการดื่มน้ำรายวันหรือไม่?

# settings.select_time
source: Select the time you'd like to be reminded
th: เลือกเวลาที่คุณต้องการได้รับการแจ้งเตือน

# settings.reminder_set
source: Daily reminder set for %@
th: ตั้งการแจ้งเตือนรายวันเวลา %@ แล้ว

# settings.reminder_disabled
source: Daily reminder disabled
th: ปิดการแจ้งเตือนรายวันแล้ว

# settings.reminders_updated
source: Reminder settings updated
th: อัปเดตการตั้งค่าการแจ้งเตือนแล้ว

# user.default_name
source: User
th: ผู้ใช้

# alert.ok
source: OK
th: ตกลง

# alert.cancel
source: Cancel
th: ยกเลิก

# alert.save
source: Save
th: บันทึก

# alert.delete
source: Delete
th: ลบ

# alert.confirm
source: Confirm
th: ยืนยัน

# alert.success
source: Success
th: สำเร็จ

# alert.error
source: Error
th: ข้อผิดพลาด

# error.invalid_amount
source: Please enter a valid amount between 1-5000ml
th: กรุณาใส่ปริมาณที่ถูกต้อง 1-5000 มล.

# error.data_not_found
source: Data not found
th: ไม่พบข้อมูล

# error.save_failed
source: Failed to save data
th: บันทึกข้อมูลไม่สำเร็จ

# error.network
source: Network error occurred
th: เกิดข้อผิดพลาดเครือข่าย

# error.invalid_user
source: Invalid user data
th: ข้อมูลผู้ใช้ไม่ถูกต้อง

# error.invalid_name
source: Please enter a valid name
th: กรุณาใส่ชื่อที่ถูกต้อง

# error.unsupported_language
source: Unsupported language
th: ภาษาที่ไม่รองรับ

# error.invalid_time_range
source: Start time must be before end time
th: เวลาเริ่มต้องมาก่อนเวลาสิ้นสุด

# error.invalid_interval
source: Reminder interval must be between 30 minutes and 8 hours
th: ช่วงเวลาแจ้งเตือนต้องอยู่ระหว่าง 30 นาที ถึง 8 ชั่วโมง

# error.image_too_large
source: Image size must be less than 5MB
th: ขนาดรูปภาพต้องน้อยกว่า 5MB

# error.location.denied
source: Location permission denied
th: ไม่อนุญาตการเข้าถึงตำแหน่ง

# error.location.not_determined
source: Location permission not determined
th: ยังไม่ได้กำหนดการอนุญาตตำแหน่ง

# error.location.not_available
source: Location not available
th: ไม่มีข้อมูลตำแหน่ง

# error.location.unknown
source: Unknown location error
th: ข้อผิดพลาดตำแหน่งที่ไม่ทราบสาเหตุ

# error.api.invalid_url
source: Invalid URL
th: URL ไม่ถูกต้อง

# error.api.invalid_response
source: Invalid response
th: การตอบสนองไม่ถูกต้อง

# error.api.server_error
source: Server error: %d
th: ข้อผิดพลาดเซิร์ฟเวอร์: %d

# error.api.network
source: Network error: %@
th: ข้อผิดพลาดเครือข่าย: %@

# error.api.decoding
source: Failed to decode response
th: ถอดรหัสการตอบสนองไม่สำเร็จ

# error.notification.denied
source: Notification permission denied
th: ไม่อนุญาตการแจ้งเตือน

# error.notification.scheduling
source: Failed to schedule notification
th: กำหนดเวลาแจ้งเตือนไม่สำเร็จ

# error.notification.unknown
source: Unknown notification error
th: ข้อผิดพลาดการแจ้งเตือนที่ไม่ทราบสาเหตุ

# error.encoding_failed
source: Failed to encode data
th: เข้ารหัสข้อมูลไม่สำเร็จ

# error.decoding_failed
source: Failed to decode data
th: ถอดรหัสข้อมูลไม่สำเร็จ

# notification.reminder.title
source: Time to Hydrate!
th: เวลาดื่มน้ำ!

# notification.reminder.body
source: Don't forget to drink some water!
th: อย่าลืมดื่มน้ำนะ!

# notification.message.1
source: Stay hydrated! Time for some water 💧
th: ดื่มน้ำให้พอ! ถึงเวลาดื่มน้ำแล้ว 💧

# notification.message.2
source: Your body is calling for water! 🥤
th: ร่างกายเรียกหาน้ำ! 🥤

# notification.message.3
source: Hydration time! Keep up the good work! 👍
th: เวลาดื่มน้ำ! ทำต่อไป! 👍

# notification.message.4
source: Don't forget to drink water and stay healthy! 💪
th: อย่าลืมดื่มน้ำเพื่อสุขภาพ! 💪

# notification.message.5
source: Time to refuel with some refreshing water! ⚡
th: เวลาเติมน้ำให้ร่างกาย! ⚡

# quickaction.add_small.title
source: Add 250ml
th: เพิ่ม 250 มล.

# quickaction.add_small.subtitle
source: Quick log small glass
th: บันทึกแก้วเล็กด่วน

# quickaction.add_medium.title
source: Add 500ml
th: เพิ่ม 500 มล.

# quickaction.add_medium.subtitle
source: Quick log bottle
th: บันทึกขวดด่วน

# quickaction.view_progress.title
source: View Progress
th: ดูความคืบหน้า

# quickaction.view_progress.subtitle
source: Check today's intake
th: ตรวจสอบปริมาณวันนี้

# quickaction.reminder.title
source: Set Quick Reminder
th: ตั้งการแจ้งเตือนด่วน

# quickaction.reminder.subtitle
source: Remind in 1 hour
th: แจ้งเตือนใน 1 ชั่วโมง

# quickaction.success.added
source: Added %dml successfully!
th: เพิ่ม %d มล. สำเร็จ!

# quickaction.reminder.set
source: Reminder set for 1 hour!
th: ตั้งการแจ้งเตือน 1 ชั่วโมงแล้ว!

# quickaction.reminder.failed
source: Failed to set reminder
th: ตั้งการแจ้งเตือนไม่สำเร็จ
